reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
    for (;;) {
        ReflectanceReading reading;
        reading.timestamp_ms  = millis();
        reading.left_raw      = (uint16_t)analogRead(Pins::QTR_LEFT_OUT);
        reading.right_raw     = (uint16_t)analogRead(Pins::QTR_RIGHT_OUT);
        reading.left_on_line  = reading.left_raw  > kDarkThreshold;
        reading.right_on_line = reading.right_raw > kDarkThreshold;

        PushDropOldest(g_reflectQueue, reading);

        Heartbeat(TaskId::REFLECTANCE);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.6  LedTask — LED RGB: indicador puro de la línea/zona de piso
// ---------------------------------------------------------------------------
//  Único trabajo del LED en esta variante: decir sobre qué está parado el
//  robot AHORA MISMO, nada más — ni equipo, ni "veo la bandera".
//    · Piso gris (FLOOR) o sin lectura válida -> apagado.
//    · Amarillo / rojo / azul                 -> ese mismo color, fijo.
//    · Negro (borde)                          -> destello alternando
//                                                 rojo/azul, como alerta.

namespace RgbLed {
    constexpr uint8_t CH_R = 4;
    constexpr uint8_t CH_G = 5;
    constexpr uint8_t CH_B = 6;

    // POLARIDAD CONFIRMADA con el LED físico: es CÁTODO COMÚN, o sea duty
    // alto = canal más brillante (mismo caso que firmware-esp32/). La
    // constante se conserva por si algún día se cambia el LED por uno de
    // ánodo común.
    constexpr bool kCommonAnode = false;

    void Setup() {
        PwmAttach(Pins::LED_RGB_R, CH_R, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_G, CH_G, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_B, CH_B, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
    }

    void SetRaw(uint8_t r, uint8_t g, uint8_t b) {
        if (kCommonAnode) { r = 255 - r; g = 255 - g; b = 255 - b; }
        PwmWrite(Pins::LED_RGB_R, CH_R, r);
        PwmWrite(Pins::LED_RGB_G, CH_G, g);
        PwmWrite(Pins::LED_RGB_B, CH_B, b);
    }

    // Color fijo de las zonas que NO parpadean. BLACK no aparece aquí a
    // propósito: LedTask lo maneja aparte, alternando rojo/azul.
    void ApplyZone(ColorLabel zone) {
        switch (zone) {
            case ColorLabel::YELLOW: SetRaw(255, 170, 0); break;
            case ColorLabel::RED:    SetRaw(255, 0, 0);   break;
            case ColorLabel::BLUE:   SetRaw(0, 0, 255);   break;
            case ColorLabel::BLACK:
            case ColorLabel::FLOOR:
            case ColorLabel::UNKNOWN:
            default:
                SetRaw(0, 0, 0);   // apagado: piso neutro o sin lectura
                break;
        }
    }
}

// Cuántas vueltas de LedTask dura cada mitad del destello rojo/azul sobre
// el borde negro. A TaskPeriodMs::LED_STATUS (100 ms) y 3 vueltas por
// mitad, el ciclo completo dura 600 ms (~1.7 Hz): lo bastante lento para
// distinguir los dos colores a simple vista, no un borrón.
constexpr uint32_t kBorderBlinkHalfPeriodTicks = 3;

void LedTask(void *) {
    RgbLed::Setup();
    RgbLed::SetRaw(0, 0, 0);

    ColorLabel zone = ColorLabel::UNKNOWN;
    uint32_t   blink_tick = 0;

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::LED_STATUS);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        LedCommand cmd;
        if (xQueueReceive(g_ledCmdQueue, &cmd, 0) == pdTRUE) {
            zone = cmd.zone;
        }

        if (zone == ColorLabel::BLACK) {
            blink_tick = (blink_tick + 1) % (2 * kBorderBlinkHalfPeriodTicks);
            if (blink_tick < kBorderBlinkHalfPeriodTicks) {
                RgbLed::SetRaw(255, 0, 0);
            } else {
                RgbLed::SetRaw(0, 0, 255);
            }
        } else {
            blink_tick = 0;
            RgbLed::ApplyZone(zone);
        }

        Heartbeat(TaskId::LED_STATUS);
        vTaskDelayUntil(&last_wake, period);
    }
}

} // namespace anónimo (tareas de hardware)

// ===========================================================================
//  [9] MISSIONTASK — el cerebro, sin Raspberry Pi
// ===========================================================================
//
//  Puerto directo de la lógica de raspberry-pi/src/athena/decision.py a
//  C++, adaptado a que aquí NO hay percepción visual de la bandera: donde
//  decision.py usaba ``perception.best(bandera_objetivo)`` (una detección
//  de la cámara con clase, ángulo y distancia), esta versión usa el
//  VL53L1X como sustituto ciego — ver el aviso grande al principio del
//  archivo. Las prioridades y el orden de fases son EXACTAMENTE los mismos
//  que allá, por la misma razón: salirse de la pista y adelantar la
//  secuencia pierden la ronda de inmediato, así que esas dos reglas no
//  pueden depender de que nada más ande bien.

namespace Mission {

// Interruptor de emergencia: en false, MissionTask NO mueve motores ni el
// gripper — solo lee los sensores y deja que el LED (LedTask) siga mostrando
// la zona de piso. Sirve para probar sensores en el banco, o para desactivar
// el robot sin desconectarle nada.
//
// Estuvo en false durante unas pruebas en las que el robot se reiniciaba
// solo. La causa resultó ser un problema de CONEXIÓN, no de batería baja
// como se sospechó al principio, así que ya no hay motivo para dejarlo
// apagado: la misión completa está habilitada.
constexpr bool kMotionEnabled = true;

// Velocidades y umbrales — mismo rol que ControlConfig en decision.py,
// pero constexpr porque aquí no hay archivo de configuración que cargar.
constexpr int kVelocidadCrucero     = 45;   // % de PWM al avanzar recto
constexpr int kVelocidadBusqueda    = 35;   // % al girar buscando
constexpr int kVelocidadAproximacion = 30;  // % al acercarse / evadir

constexpr uint16_t kDistanciaAgarreMm = 150;  // debajo de esto: cerrar la pinza
constexpr uint8_t  kTofDebounceHits   = 3;    // lecturas seguidas antes de agarrar

constexpr uint32_t kStartupDelayMs   = 3000;  // tiempo para cargar la llave y ubicar el robot
constexpr uint32_t kGripperSettleMs  = 400;   // tiempo mecánico para que el servo llegue
constexpr uint32_t kSpinBurstMs      = 900;   // barrido: cuánto gira sobre su eje
constexpr uint32_t kForwardBurstMs   = 700;   // barrido: cuánto avanza entre giros
constexpr uint32_t kReturnTurnMs     = 1500;  // giro aproximado de 180°, A CALIBRAR EN BANCO

enum class Phase : uint8_t {
    ARRANQUE = 0,
    ASEGURAR_LLAVE,
    BUSCAR_ZONA_NEUTRA,
    DEPOSITAR_LLAVE,
    BUSCAR_BANDERA,
    AGARRAR_BANDERA,
    RETORNAR_GIRANDO,
    RETORNAR_AVANZANDO,
    ENTREGAR,
    TERMINADO,
};

inline ColorLabel ZonaPropia(TeamColor team) {
    return (team == TeamColor::RED) ? ColorLabel::RED : ColorLabel::BLUE;
}

