reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
// Nombre legible de cada fase, para el log — sin esto, el monitor serial
// solo mostraba el número crudo del enum y había que contar a mano.
inline const char *PhaseName(Phase phase) {
    switch (phase) {
        case Phase::ARRANQUE:            return "ARRANQUE";
        case Phase::ASEGURAR_LLAVE:      return "ASEGURAR_LLAVE";
        case Phase::BUSCAR_ZONA_NEUTRA:  return "BUSCAR_ZONA_NEUTRA";
        case Phase::DEPOSITAR_LLAVE:     return "DEPOSITAR_LLAVE";
        case Phase::BUSCAR_BANDERA:      return "BUSCAR_BANDERA";
        case Phase::AGARRAR_BANDERA:     return "AGARRAR_BANDERA";
        case Phase::RETORNAR_GIRANDO:    return "RETORNAR_GIRANDO";
        case Phase::RETORNAR_AVANZANDO:  return "RETORNAR_AVANZANDO";
        case Phase::ENTREGAR:            return "ENTREGAR";
        case Phase::TERMINADO:           return "TERMINADO";
        default:                         return "DESCONOCIDA";
    }
}

} // namespace Mission

// Evita depender de que el compilador trate a MotorCommand como agregado
// con inicializadores por defecto (necesita C++14+); igual que hace
// firmware-esp32/src/main.cpp, se asigna campo a campo.
inline void SetDrive(MotorCommand &m, int left, int right) {
    m.mode  = MotorMode::DRIVE;
    m.left  = (int8_t)constrain(left, -100, 100);
    m.right = (int8_t)constrain(right, -100, 100);
}

void MissionTask(void *pvTeam) {
    const TeamColor team = *reinterpret_cast<TeamColor *>(pvTeam);

    Mission::Phase phase = Mission::Phase::ARRANQUE;
    Mission::Phase last_logged_phase = phase;
    uint32_t phase_started_ms = millis();

    // Estado propio del barrido de búsqueda (fase BUSCAR_BANDERA).
    bool     buscando_gira = true;
    int8_t   sentido = 1;
    uint8_t  tof_hits = 0;

    ColorReading       last_color{};
    ReflectanceReading last_reflect{};
    TofReading         last_tof{};

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::MISSION);
    TickType_t last_wake = xTaskGetTickCount();

    DEBUG_LINK.printf("[Mission] equipo = %s\n", team == TeamColor::RED ? "ROJO" : "AZUL");

    for (;;) {
        // --- 0. Refrescar la última lectura de cada sensor -----------------
        // Igual que hacía run_rover.py: se drena toda la cola y solo importa
        // el dato más reciente de cada tipo.
        ColorReading c;
        while (xQueueReceive(g_colorQueue, &c, 0) == pdTRUE) last_color = c;
        ReflectanceReading r;
        while (xQueueReceive(g_reflectQueue, &r, 0) == pdTRUE) last_reflect = r;
        TofReading t;
        while (xQueueReceive(g_tofQueue, &t, 0) == pdTRUE) last_tof = t;
        HealthReport h;
        while (xQueueReceive(g_healthQueue, &h, 0) == pdTRUE) {
            DEBUG_LINK.printf("[Mission] tareas colgadas, bitmask=0x%02X\n", h.faulted_tasks_bitmask);
        }

        MotorCommand motor;               // por defecto: STOP
        GripperCommand gripper;
        bool send_gripper = false;

        // Interruptor de batería baja (Mission::kMotionEnabled): si está en
        // false, todo lo de aquí abajo se salta por completo. motor se queda
        // en su valor por defecto (STOP) y gripper nunca se envía — el
        // robot no mueve nada, solo sigue leyendo sensores y mostrando la
        // zona por el LED (eso pasa siempre, fuera de este bloque).
        if (Mission::kMotionEnabled) {

        // --- 1. PRIORIDAD MÁXIMA: no salirse de la pista -------------------
        // Idéntico a decision.py::_evadir_borde: pisa cualquier otra fase.
        bool evadiendo = false;
        if (last_reflect.left_on_line && last_reflect.right_on_line) {
            SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion);
            evadiendo = true;
        } else if (last_reflect.left_on_line) {
            SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion / 3);
            evadiendo = true;
        } else if (last_reflect.right_on_line) {
            SetDrive(motor, -Mission::kVelocidadAproximacion / 3, -Mission::kVelocidadAproximacion);
            evadiendo = true;
        }

        // Ayuda a depurar en banco: cambiar de fase se ve en el monitor
        // serial sin tener que instrumentar cada rama.
        if (phase != last_logged_phase) {
            DEBUG_LINK.printf("[Mission] fase -> %s\n", Mission::PhaseName(phase));
            last_logged_phase = phase;
        }

        if (!evadiendo) {
            switch (phase) {

                // -- 2. Cuenta regresiva para cargar la llave a mano --------
                case Mission::Phase::ARRANQUE: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kStartupDelayMs) {
                        phase = Mission::Phase::ASEGURAR_LLAVE;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 3. Asegurar la llave que el operador ya colocó ---------
                case Mission::Phase::ASEGURAR_LLAVE: {
                    gripper.action = GripperAction::CLOSE_LLAVE;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::BUSCAR_ZONA_NEUTRA;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 4. Avanzar hasta pisar la zona amarilla ----------------
                case Mission::Phase::BUSCAR_ZONA_NEUTRA: {
                    if (last_color.front_valid && last_color.front == ColorLabel::YELLOW) {
                        phase = Mission::Phase::DEPOSITAR_LLAVE;
                        phase_started_ms = millis();
                    } else {
                        SetDrive(motor, Mission::kVelocidadCrucero, Mission::kVelocidadCrucero);
                    }
                    break;
                }

                // -- 5. Soltar la llave: única transición que habilita ------
                //       la búsqueda de bandera (igual que decision.py).
                case Mission::Phase::DEPOSITAR_LLAVE: {
                    gripper.action = GripperAction::OPEN;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::BUSCAR_BANDERA;
                        phase_started_ms = millis();
                        buscando_gira = true;
                        tof_hits = 0;
                    }
                    break;
                }

                // -- 6. Barrer el área; el VL53L1X hace de "ojos" ----------
                // LIMITACIÓN A PROPÓSITO (ver el aviso grande arriba): no
                // hay forma de confirmar que lo que se detecta es la
                // bandera del equipo contrario y no cualquier otro objeto
                // u obstáculo. Es la mejor aproximación posible sin cámara.
                case Mission::Phase::BUSCAR_BANDERA: {
                    if (last_tof.valid && last_tof.distance_mm <= Mission::kDistanciaAgarreMm) {
                        if (tof_hits < 255) tof_hits++;
                    } else {
                        tof_hits = 0;
                    }

                    if (tof_hits >= Mission::kTofDebounceHits) {
                        phase = Mission::Phase::AGARRAR_BANDERA;
                        phase_started_ms = millis();
                        break;
                    }

