reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
                    const uint32_t elapsed = millis() - phase_started_ms;
                    if (buscando_gira) {
                        SetDrive(motor, Mission::kVelocidadBusqueda * sentido,
                                        -Mission::kVelocidadBusqueda * sentido);
                        if (elapsed > Mission::kSpinBurstMs) {
                            buscando_gira = false;
                            phase_started_ms = millis();
                        }
                    } else {
                        // Avance con un leve arco, para barrer el ToF a
                        // ambos lados en vez de solo mirar de frente.
                        const int base = Mission::kVelocidadAproximacion;
                        const int sesgo = 10 * sentido;
                        SetDrive(motor, base + sesgo, base - sesgo);
                        if (elapsed > Mission::kForwardBurstMs) {
                            buscando_gira = true;
                            sentido = (int8_t)-sentido;   // alterna el lado del barrido
                            phase_started_ms = millis();
                        }
                    }
                    break;
                }

                // -- 7. Cerrar la pinza sobre lo que haya delante -----------
                case Mission::Phase::AGARRAR_BANDERA: {
                    gripper.action = GripperAction::CLOSE_BANDERA;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::RETORNAR_GIRANDO;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 8a. Girar ~180° antes de buscar la zona propia ---------
                // Sin odometría ni referencia visual (mismo hueco que anota
                // decision.py::_retornar): es un giro a tiempo fijo, A
                // CALIBRAR EN BANCO según el peso real del robot y la
                // fricción de la pista.
                case Mission::Phase::RETORNAR_GIRANDO: {
                    SetDrive(motor, Mission::kVelocidadBusqueda, -Mission::kVelocidadBusqueda);
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kReturnTurnMs) {
                        phase = Mission::Phase::RETORNAR_AVANZANDO;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 8b. Avanzar hasta pisar la zona del propio equipo ------
                case Mission::Phase::RETORNAR_AVANZANDO: {
                    if (last_color.front_valid && last_color.front == Mission::ZonaPropia(team)) {
                        phase = Mission::Phase::ENTREGAR;
                        phase_started_ms = millis();
                    } else {
                        SetDrive(motor, Mission::kVelocidadCrucero, Mission::kVelocidadCrucero);
                    }
                    break;
                }

                // -- 9. Soltar la bandera en zona propia ---------------------
                case Mission::Phase::ENTREGAR: {
                    gripper.action = GripperAction::OPEN;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::TERMINADO;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 10. Misión completa: quieto -----------------------------
                case Mission::Phase::TERMINADO:
                default:
                    break;
            }
        }

        } // if (Mission::kMotionEnabled)

        xQueueOverwrite(g_motorCmdQueue, &motor);
        if (send_gripper) xQueueSend(g_gripperCmdQueue, &gripper, 0);

        LedCommand led;
        led.zone = last_color.front_valid ? last_color.front : ColorLabel::UNKNOWN;
        xQueueOverwrite(g_ledCmdQueue, &led);

        Heartbeat(TaskId::MISSION);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ===========================================================================
//  [10] SUPERVISORTASK, setup() / loop()
// ===========================================================================

namespace {

void SupervisorTask(void *) {
    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::SUPERVISOR);
    TickType_t last_wake = xTaskGetTickCount();

    uint8_t previous_faults = 0;

    for (;;) {
        const uint8_t faulted = WatchdogCheck();

        if (faulted != 0) {
            HealthReport report;
            report.timestamp_ms = millis();
            report.faulted_tasks_bitmask = faulted;
            xQueueOverwrite(g_healthQueue, &report);
        }

        if (faulted != previous_faults) {
            DEBUG_LINK.printf("[Supervisor] tareas colgadas: 0x%02X\n", faulted);
            previous_faults = faulted;
        }

        vTaskDelayUntil(&last_wake, period);
    }
}

} // namespace anónimo

static bool CreateQueues() {
    g_motorCmdQueue   = xQueueCreate(1, sizeof(MotorCommand));
    g_gripperCmdQueue = xQueueCreate(4, sizeof(GripperCommand));
    g_ledCmdQueue     = xQueueCreate(1, sizeof(LedCommand));
    g_colorQueue      = xQueueCreate(4, sizeof(ColorReading));
    g_reflectQueue    = xQueueCreate(4, sizeof(ReflectanceReading));
    g_tofQueue        = xQueueCreate(4, sizeof(TofReading));
    g_healthQueue     = xQueueCreate(1, sizeof(HealthReport));

    return g_motorCmdQueue && g_gripperCmdQueue && g_ledCmdQueue &&
           g_colorQueue && g_reflectQueue && g_tofQueue && g_healthQueue;
}

constexpr uint32_t SERIAL_BAUD_RATE = 115200;

// Vive fuera de setup() porque MissionTask la recibe por puntero al crear
// la tarea (xTaskCreatePinnedToCore no admite pasar un TeamColor por valor
// directamente): tiene que sobrevivir a setup() retornando.
static TeamColor g_myTeam = TeamColor::BLUE;   // sobrescrito abajo por el switch de equipo

// Traduce el motivo del último reinicio a algo legible. Existe porque el
// USB nativo se reenumera solo con cada reset del ESP32-S3: un monitor
// serial conectado pierde los primeros logs mientras se reconecta, así que
// "¿por qué se reinició?" es justo la pregunta que más se pierde sin este
// mensaje explícito (ver el bloqueo de reconexión más abajo en setup()).
static const char *ResetReasonToString(esp_reset_reason_t reason) {
    switch (reason) {
        case ESP_RST_POWERON:   return "POWERON (se energizo desde cero)";
        case ESP_RST_EXT:       return "EXTERNO (pin de reset)";
        case ESP_RST_SW:        return "SOFTWARE (esp_restart() o similar)";
        case ESP_RST_PANIC:     return "PANIC (excepcion/crash del firmware)";
        case ESP_RST_INT_WDT:   return "INTERRUPT WATCHDOG";
        case ESP_RST_TASK_WDT:  return "TASK WATCHDOG (una tarea no volvio a tiempo)";
        case ESP_RST_WDT:       return "OTRO WATCHDOG";
        case ESP_RST_DEEPSLEEP: return "DEEP SLEEP";
        case ESP_RST_BROWNOUT:  return "BROWNOUT: el voltaje cayo debajo del minimo -- revisar bateria/alimentacion";
        case ESP_RST_SDIO:      return "SDIO";
        default:                return "DESCONOCIDO";
    }
}

void setup() {
    DEBUG_LINK.begin(SERIAL_BAUD_RATE);

